[
    {
        "company": "Stony Brook University",
        "company_location": "Stony Brook, NY",
        "role": "Teaching Assistant",
        "team": "Prof. Ahmad Esmaili | CSE214 - Data Structures",
        "time_duration": "Aug 2022 - Dec 2022",
        "details": [
            {
                "title": "Responsibilities",
                "description": "Hosting office hours, hosting recitations, grading assignments and exam papers.",
                "keywords": ["Java"]
            }
        ]
    },
    {
        "company": "(Freelance)",
        "company_location": "Remotely from Home",
        "role": "Software Developer",
        "team": "On the Fiverr platform",
        "time_duration": "Oct 2021 - Jun 2022",
        "details": [
            {
                "title": "Tutoring",
                "description": "Tutored several students over Zoom. Courses ranged from Object Oriented Programming to Design Patterns in Java."
            },
            {
                "title": "Country Factbook Scraper",
                "description": "The only major freelance undertaking. Wrote a node.js based library to scrape CIA's World Factbook."
            }
        ]
    },
    {
        "company": "Amazon",
        "company_location": "Bangalore, India",
        "role": "Software Development Engineer",
        "team": "Alexa Money Domain",
        "time_duration": "Jun 2018 - Jan 2021",
        "details": [
            {
                "title": "NLU Grammars for Alexa Money Domain use-cases",
                "description": "Created Natural Language Understanding grammars for several Alexa Money Domain projects. Got training for, and used an Alexa-internal Domain Specific Language."
            },
            {
                "title": "Political Donations using Alexa",
                "description": "Worked on the NLU and Java backend components for enabling donations to US 2020 presidential election candidates. This enabled users to make donations to their favourite candidate using their Alexa device. Worked on making the involved systems compliant with US Federal and state laws."
            },
            {
                "title": "Amazon Pay components on the Alexa mobile app",
                "description": "Implemented Amazon Pay's UI elements on the Alexa mobile app on Android and iOS. Used the React Native framework and TypeScript. Performed testing using Android Studio and XCode."
            },
            {
                "title": "Merchant Payments using Alexa",
                "description": "Worked on enabling the Alexa payments platform in Europe and Japan regions."
            }
        ]
    },
    {
        "company": "Amazon",
        "company_location": "Bangalore, India",
        "role": "Software Development Engineer - Intern",
        "team": "Amazon Pay",
        "time_duration": "May 2017 - Jul 2017",
        "details": [
            {
                "title": "Data Migration Pipeline",
                "description": "Created a data migration pipeline that would facilitate the backfilling of millions of entries of historical transaction data from an Amazon-internal database platform to AWS DynamoDB. At the end of this internship, I was awarded a pre-placement offer for returning to work full-time for Amazon after graduating."
            }
        ]
    }
]
